Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ1064DAA288.atdf
      <value-group caption="Early Interrupt Enable for Analog Input bit 44" name="ADCEIEN2__EIEN44">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 0" name="ADCEISTAT1__EIRDY0">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 1" name="ADCEISTAT1__EIRDY1">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 2" name="ADCEISTAT1__EIRDY2">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 3" name="ADCEISTAT1__EIRDY3">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 4" name="ADCEISTAT1__EIRDY4">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 5" name="ADCEISTAT1__EIRDY5">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 6" name="ADCEISTAT1__EIRDY6">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 7" name="ADCEISTAT1__EIRDY7">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 8" name="ADCEISTAT1__EIRDY8">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 9" name="ADCEISTAT1__EIRDY9">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 10" name="ADCEISTAT1__EIRDY10">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 11" name="ADCEISTAT1__EIRDY11">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bit 12" name="ADCEISTAT1__EIRDY12">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
