Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ1064DAA288.atdf
      <value-group caption="Half Rate bit" name="DDRPHYPADCON__HALFRATE">
         <value caption="Controller clock is running at half rate with respect to PHY" name="" value="0x1" />
         <value caption="Controller clock is running at full rate with respect to PHY" name="" value="0x0" />
      </value-group>
      <value-group caption="NFET Drive Strength bits" name="DDRPHYPADCON__DRVSTRNFET">
         <value caption="Maximum drive strength" name="" value="0xf" />
         <value caption="Minimum drive strength." name="" value="0x0" />
      </value-group>
      <value-group caption="PFET Drive Strength bits" name="DDRPHYPADCON__DRVSTRPFET">
         <value caption="Maximum drive strength" name="" value="0xf" />
         <value caption="Minimum drive strength." name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="DDRPHYPADCON__RCVREN">
         <value caption="Pad receivers on bidirectional I/Os are turned on" name="" value="0x1" />
         <value caption="Pad receivers on bidirectional I/Os are turned off" name="" value="0x0" />
      </value-group>
      <value-group caption="Preamble Delay bits" name="DDRPHYPADCON__PREAMBDLY">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="1 cycle preamble" name="" value="0x2" />
         <value caption="1.5 cycle preamble" name="" value="0x1" />
         <value caption="2 cycle preamble" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable Recalibration bit" name="DDRPHYDLLR__DISRECALIB">
         <value caption="Do not recalibrate the digital DLL after the first time" name="" value="0x1" />
         <value caption="Recalibrate the digital DLL in accordance with the value of the RECALIBCNT bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Trim Setting bits" name="DDRPHYDLLCTRL__DDRDLLTRIM">
         <value caption="These bits control the Trim settings for adjusting the output time of the bank address and control signals with respect to data signals (DQ/DQS). The recommended value is 0x1." name="" value="" />
      </value-group>
      <value-group caption="Bypass Analog DLL bit" name="DDRADLLBYP__ANLDLLBYP">

         <value caption="Bypass the Analog DLL and use the PHY Digital DLL" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="Memory Lane Select bits" name="DDRSCLCFG2__SCLLANSEL">
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Use the upper byte lane" name="" value="0x2" />
         <value caption="Use the lower byte lane" name="" value="0x1" />
         <value caption="Use both lanes" name="" value="0x0" />
      </value-group>
      <value-group caption="SCL Bank Address bits" name="DDRPHYSCLADR__SCLBANKADR">
         <value caption="These bits define the bank address to use when running SCL" name="" value="" />
      </value-group>
      <value-group caption="SCL Column Address bits" name="DDRPHYSCLADR__SCLCOLADR">
         <value caption="These bits define the column address to use when running SCL" name="" value="" />
      </value-group>
      <value-group caption="SCL Row Address bits" name="DDRPHYSCLADR__SCLROWADR">
         <value caption="These bits define the column address to use when running SCL" name="" value="" />
      </value-group>
      <value-group caption="DDR Clock Delay Delta bits" name="DDRPHYCLKDLY__CLKDLYDELTA">
         <value caption="7 DDR clocks" name="" value="0x7" />
         <value caption="6 DDR clocks" name="" value="0x6" />
         <value caption="5 DDR clocks" name="" value="0x5" />
         <value caption="4 DDR clocks" name="" value="0x4" />
         <value caption="3 DDR clocks" name="" value="0x3" />
         <value caption="2 DDR clocks" name="" value="0x2" />
         <value caption="1 DDR clocks" name="" value="0x1" />
         <value caption="0 DDR clocks" name="" value="0x0" />
      </value-group>
      <value-group caption="Self Calibration Logic Lower Data Byte Status bit" name="DDRPHYCLKDLY__SCLLBPASS">
         <value caption="Self calibration logic for lower data byte is passed" name="" value="0x2" />
         <value caption="Self calibration logic for lower data byte is failed" name="" value="0x0" />
      </value-group>
      <value-group caption="Self Calibration Logic Upper Data Byte Status bit" name="DDRPHYCLKDLY__SCLUBPASS">
         <value caption="Self calibration logic for upper data byte is passed" name="" value="0x2" />
         <value caption="Self calibration logic for upper data byte is failed" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01500" name="DMAC" version="2">
      <register-group name="DMAC">
         <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY" />
            <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND" />
            <bitfield caption="DMA On bit" mask="0x00008000" name="ON" values="DMACON__ON" />
         </register>
         <register caption="DMA Status Register" name="DMASTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x00000007" name="DMACH" />
            <bitfield caption="Read/Write Status bit" mask="0x80000000" name="RDWR" values="DMASTAT__RDWR" />
         </register>
         <register caption="DMA Address Register" name="DMAADDR" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="DMA CRC Control Register" name="DCRCCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="CRC Channel Select bits" mask="0x00000007" name="CRCCH" values="DCRCCON__CRCCH" />
            <bitfield caption="CRC Type Selection bit" mask="0x00000020" name="CRCTYP" values="DCRCCON__CRCTYP" />
            <bitfield caption="CRC Append Mode bit" mask="0x00000040" name="CRCAPP" values="DCRCCON__CRCAPP" />
            <bitfield caption="CRC Enable bit" mask="0x00000080" name="CRCEN" values="DCRCCON__CRCEN" />
            <bitfield caption="Polynomial Length bits" mask="0x00001F00" name="PLEN" values="DCRCCON__PLEN" />
            <bitfield caption="CRC Bit Order Selection bit" mask="0x01000000" name="BITO" values="DCRCCON__BITO" />
            <bitfield caption="CRC Write Byte Order Selection bit" mask="0x08000000" name="WBO" values="DCRCCON__WBO" />
            <bitfield caption="CRC Byte Order Selection bits" mask="0x30000000" name="BYTO" values="DCRCCON__BYTO" />
         </register>
         <register caption="DMA CRC Data Register" name="DCRCDATA" offset="0x40" rw="RW" size="4">
            <bitfield caption="CRC Data Register bits" mask="0xFFFFFFFF" name="DCRCDATA" values="DCRCDATA__DCRCDATA" />
         </register>
         <register caption="DMA CRCXOR Enable Register" name="DCRCXOR" offset="0x50" rw="RW" size="4">
            <bitfield caption="CRC XOR Register bits" mask="0xFFFFFFFF" name="DCRCXOR" values="DCRCXOR__DCRCXOR" />
         </register>
