Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ1064DAA288.atdf
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT4ECLRM" offset="0x1018" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT5ECLRM" offset="0x1418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT6ECLRM" offset="0x1818" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT7ECLRM" offset="0x10418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT8ECLRM" offset="0x10818" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT9ECLRM" offset="0x10c18" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT10ECLRM" offset="0x11018" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT11ECLRM" offset="0x11418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT12ECLRM" offset="0x11818" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT13ECLRM" offset="0x20418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT14ECLRM" offset="0x20818" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT15ECLRM" offset="0x20c18" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT16ECLRM" offset="0x34418" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR" />
         </register>
         <register caption="" name="SBT0REG0" offset="0x20" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT0REG1" offset="0x40" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG0" offset="0x420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG2" offset="0x460" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG3" offset="0x480" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG3__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG3__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG4" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG4__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG4__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG5" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG5__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG5__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG6" offset="0x4e0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG6__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG6__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG7" offset="0x500" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG7__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG7__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT1REG8" offset="0x520" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG8__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG8__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
